---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.DesignOptionFailures.CannotAddToOptions
source: html/1382d541-176c-e3e3-a92f-d116d393ae50.htm
---
# Autodesk.Revit.DB.BuiltInFailures.DesignOptionFailures.CannotAddToOptions Property

Elements can't be added to Option Set

## Syntax (C#)
```csharp
public static FailureDefinitionId CannotAddToOptions { get; }
```